home buh/src/Documents/ПокупкаПродуктов/ПокупкаПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаПродуктов</name>
  <basedOn>Document.ПланПокупок</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаСчетах</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеДСПоСтатьям</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВПродуктах</registerRecords>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>EnumRef.ФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПокупкаПродуктов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

home buh/src/Documents/ПокупкаПродуктов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПокупкаПродуктовКоличествоПриИзменении(Элемент)
	ТекДанныеПокупкаПродуктов = Элементы.ПокупкаПродуктов.ТекущиеДанные;
	ТекДанныеПокупкаПродуктов.Итого = ТекДанныеПокупкаПродуктов.Количество * ТекДанныеПокупкаПродуктов.Цена;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаПродуктовЦенаПриИзменении(Элемент)
	ТекДанныеПокупкаПродуктов = Элементы.ПокупкаПродуктов.ТекущиеДанные;
	ТекДанныеПокупкаПродуктов.Итого = ТекДанныеПокупкаПродуктов.Количество * ТекДанныеПокупкаПродуктов.Цена;
	а=1;
КонецПроцедуры
